Reports/КалькуляцияСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>КалькуляцияСебестоимости</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/КалькуляцияСебестоимости/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
Перем НП Экспорт;

Функция СформироватьТекстЗапроса()
	
	Условие="";
	
	Если не Номенклатура.Пустая() Тогда
		Условие=" ГДЕ Выпуск.НоменклатурнаяГруппаВыпуска = &Номенклатура ";
	КонецЕсли;	
	
	Если не Подразделение.Пустая() Тогда
		Условие=?(Условие="","ГДЕ "," И ")+" Выпуск.ПодразделениеВыпуска = &Подразделение ";
	КонецЕсли;		
	
	Текст = 
	"ВЫБРАТЬ
	|	Выпуск.ПодразделениеВыпуска КАК Подразделение,
	|	Выпуск.НоменклатурнаяГруппаВыпуска КАК НоменклатурнаяГруппа,
	|	Выпуск.НоменклатураВыпуска КАК Номенклатура,
	|	ПрямыеЗатраты.ЗатратыПрямыхЗатрат КАК ПрямыеЗатраты,
	|	ПрямыеЗатраты.КорСчетПрямыхЗатрат КАК КорСчетПрямыхЗатрат,
	|	ПрямыеЗатраты.КорСубконтоПрямыхЗатрат КАК НоменклатураПрямыхЗатрат,
	|	ОбщеПроизводственныеЗатраты.Затраты25 КАК Затраты25,
	|	ЕСТЬNULL(Выпуск.КоличествоВыпуска, 0) КАК Количество,
	|	ЕСТЬNULL(Выпуск.ОбщаяСуммаВыпуска, 0) КАК ОбщаяСуммаВыпуска,
	|	ЕСТЬNULL(Выпуск.СуммаВыпуска, 0) КАК Сумма,
	|	ЕСТЬNULL(ПрямыеЗатраты.СуммаПрямыхЗатрат, 0) КАК СуммаПрямыхЗатрат,
	|	ЕСТЬNULL(НЗП.НачОст, 0) КАК НачОстНЗП,
	|	ЕСТЬNULL(НЗП.КонОст, 0) КАК КонОстНЗП,
	|	ЕСТЬNULL(ОбщеПроизводственныеЗатраты.Сумма25, 0) КАК Сумма25,
	|	ЕСТЬNULL(ПрямыеЗатраты.КоличествоПрямыхЗатрат, 0) КАК КоличествоПрямыхЗатрат,
	|	ЕСТЬNULL(ПрямыеЗатраты.СуммаПрямыхЗатратНеРаспределяемая, 0) КАК СуммаПрямыхЗатратНеРаспределяемая,
	|	ЕСТЬNULL(ПрямыеЗатраты.КоличествоПрямыхЗатратНеРаспределяеммая, 0) КАК КоличествоПрямыхЗатратНеРаспределяемая
	|ИЗ
	|	(ВЫБРАТЬ
	|		ХозрасчетныйОбороты.Субконто1 КАК ПодразделениеВыпуска,
	|		ХозрасчетныйОбороты.Субконто2 КАК НоменклатурнаяГруппаВыпуска,
	|		ХозрасчетныйОбороты.Субконто2 КАК НоменклатураВыпуска,
	|		ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаВыпуска,
	|		ХозрасчетныйОбороты.СуммаОборотКт КАК ОбщаяСуммаВыпуска,
	|		ХозрасчетныйОбороты.КоличествоОборотКт КАК КоличествоВыпуска
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.Обороты(&НачДата, &КонДата, Месяц, Счет В ИЕРАРХИИ (&СчетПрямЗатрат), , Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|	ГДЕ
	|		ХозрасчетныйОбороты.СуммаОборотКт <> 0) КАК Выпуск
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ХозрасчетныйОбороты.Субконто1 КАК Подразделение25,
	|			ХозрасчетныйОбороты.Субконто2 КАК НоменклатурнаяГруппа25,
	|			ХозрасчетныйОбороты.Субконто3 КАК Затраты25,
	|			ХозрасчетныйОбороты.СуммаОборотДт КАК Сумма25
	|		ИЗ
	|			РегистрБухгалтерии.Хозрасчетный.Обороты(&НачДата, &КонДата, , Счет В ИЕРАРХИИ (&СчетПрямЗатрат), , Организация = &Организация, КорСчет В ИЕРАРХИИ (&Счет25), ) КАК ХозрасчетныйОбороты) КАК ОбщеПроизводственныеЗатраты
	|		ПО Выпуск.ПодразделениеВыпуска = ОбщеПроизводственныеЗатраты.Подразделение25
	|			И Выпуск.НоменклатурнаяГруппаВыпуска = ОбщеПроизводственныеЗатраты.НоменклатурнаяГруппа25
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК НачОст,
	|			ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК КонОст,
	|			ХозрасчетныйОстаткиИОбороты.Субконто1 КАК ПодразделениеНЗП,
	|			ХозрасчетныйОстаткиИОбороты.Субконто2 КАК НоменклатурнаяГруппаНЗП
	|		ИЗ
	|			РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачДата, &КонДата, Месяц, , Счет В ИЕРАРХИИ (&СчетПрямЗатрат), , Организация = &Организация) КАК ХозрасчетныйОстаткиИОбороты) КАК НЗП
	|		ПО Выпуск.НоменклатурнаяГруппаВыпуска = НЗП.НоменклатурнаяГруппаНЗП
	|			И Выпуск.ПодразделениеВыпуска = НЗП.ПодразделениеНЗП
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Промежуток.ПодразделениеПрямыхЗатрат КАК ПодразделениеПрямыхЗатрат,
	|			Промежуток.НоменклатурнаяГруппаПрямыхЗатрат КАК НоменклатурнаяГруппаПрямыхЗатрат,
	|			Промежуток.ЗатратыПрямыхЗатрат КАК ЗатратыПрямыхЗатрат,
	|			Промежуток.КорСчетПрямыхЗатрат КАК КорСчетПрямыхЗатрат,
	|			Промежуток.КорСубконтоПрямыхЗатрат КАК КорСубконтоПрямыхЗатрат,
	|			СУММА(Промежуток.СуммаПрямыхЗатрат) КАК СуммаПрямыхЗатрат,
	|			СУММА(Промежуток.КоличествоПрямыхЗатрат) КАК КоличествоПрямыхЗатрат,
	|			Промежуток.Продукция КАК Продукция,
	|			СУММА(Промежуток.СуммаПрямыхЗатратНеРаспределяемая) КАК СуммаПрямыхЗатратНеРаспределяемая,
	|			СУММА(Промежуток.КоличествоПрямыхЗатратНеРаспределяеммая) КАК КоличествоПрямыхЗатратНеРаспределяеммая
	|		ИЗ
	|			(ВЫБРАТЬ
	|				ХозрасчетныйОбороты.Субконто1 КАК ПодразделениеПрямыхЗатрат,
	|				ХозрасчетныйОбороты.Субконто2 КАК НоменклатурнаяГруппаПрямыхЗатрат,
	|				ХозрасчетныйОбороты.Субконто3 КАК ЗатратыПрямыхЗатрат,
	|				ХозрасчетныйОбороты.КорСчет КАК КорСчетПрямыхЗатрат,
	|				ХозрасчетныйОбороты.КорСубконто1 КАК КорСубконтоПрямыхЗатрат,
	|				СУММА(ХозрасчетныйОбороты.СуммаОборотДт) КАК СуммаПрямыхЗатрат,
	|				СУММА(ХозрасчетныйОбороты.КоличествоКорОборотДт) КАК КоличествоПрямыхЗатрат,
	|				NULL КАК Продукция,
	|				0 КАК СуммаПрямыхЗатратНеРаспределяемая,
	|				0 КАК КоличествоПрямыхЗатратНеРаспределяеммая
	|			ИЗ
	|				РегистрБухгалтерии.Хозрасчетный.Обороты(&НачДата, &КонДата, , Счет В ИЕРАРХИИ (&СчетПрямЗатрат), , Организация = &Организация, (НЕ КорСчет В ИЕРАРХИИ (&Счет25)), ) КАК ХозрасчетныйОбороты
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ХозрасчетныйОбороты.Субконто2,
	|				ХозрасчетныйОбороты.КорСубконто1,
	|				ХозрасчетныйОбороты.Субконто1,
	|				ХозрасчетныйОбороты.Субконто3,
	|				ХозрасчетныйОбороты.КорСчет) КАК Промежуток
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Промежуток.ПодразделениеПрямыхЗатрат,
	|			Промежуток.НоменклатурнаяГруппаПрямыхЗатрат,
	|			Промежуток.ЗатратыПрямыхЗатрат,
	|			Промежуток.КорСчетПрямыхЗатрат,
	|			Промежуток.КорСубконтоПрямыхЗатрат,
	|			Промежуток.Продукция) КАК ПрямыеЗатраты
	|		ПО Выпуск.ПодразделениеВыпуска = ПрямыеЗатраты.ПодразделениеПрямыхЗатрат
	|			И Выпуск.НоменклатурнаяГруппаВыпуска = ПрямыеЗатраты.НоменклатурнаяГруппаПрямыхЗатрат
	|			И (Выпуск.НоменклатураВыпуска = ПрямыеЗатраты.Продукция
	|				ИЛИ ПрямыеЗатраты.Продукция ЕСТЬ NULL )
	|	"+Условие+"
	|
	|УПОРЯДОЧИТЬ ПО
	|	Выпуск.ПодразделениеВыпуска.Наименование,
	|	Выпуск.НоменклатурнаяГруппаВыпуска.Наименование,
	|	Выпуск.НоменклатураВыпуска.Наименование
	|ИТОГИ
	|	МАКСИМУМ(Количество),
	|	СУММА(ОбщаяСуммаВыпуска),
	|	МАКСИМУМ(Сумма),
	|	МАКСИМУМ(СуммаПрямыхЗатрат),
	|	МАКСИМУМ(НачОстНЗП),
	|	МАКСИМУМ(КонОстНЗП),
	|	МАКСИМУМ(Сумма25),
	|	МАКСИМУМ(КоличествоПрямыхЗатрат),
	|	МАКСИМУМ(СуммаПрямыхЗатратНеРаспределяемая),
	|	МАКСИМУМ(КоличествоПрямыхЗатратНеРаспределяемая)
	|ПО
	|	Подразделение,
	|	НоменклатурнаяГруппа,
	|	Номенклатура,
	|	ПрямыеЗатраты,
	|	КорСчетПрямыхЗатрат,
	|	НоменклатураПрямыхЗатрат,
	|	Затраты25";
	
	
	
	Возврат Текст;
	
КонецФункции

Процедура ВывестиОбласть(ДокументРезультат, ОбластьОсновная,  ОбластьОкончание, Уровень, ИмяГруппы, Открыта, ИмяПараметра, Выборка)
	
	//Если ПодробноеПредставление < Уровень Тогда
	//	Возврат;
	//КонецЕсли;
	
	Если Уровень = 0 Тогда
		ОбластьНачало = ДокументРезультат.Вывести(ОбластьОсновная);
	Иначе
		ОбластьНачало = ДокументРезультат.Вывести(ОбластьОсновная, Уровень, ИмяГруппы, Открыта);
	КонецЕсли;
	
	Если Уровень = 0 Тогда
		ОбластьКонец = ДокументРезультат.Присоединить(ОбластьОкончание);
	Иначе
		
		ОбластьКонец = ДокументРезультат.Присоединить(ОбластьОкончание, Уровень, ИмяГруппы, Открыта);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСуммуВыпускаПродукции(НачалоПериода,КонецПериода,Подразделение, НоменклатурнаяГруппа, Номенклатура=Неопределено)
	ДатаНач = НачалоМесяца(НачалоПериода);
	ДатаКон  = КонецМесяца(КонецПериода);
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ХозрасчетныйОбороты.СуммаОборотКт
	               |ИЗ
	               |	РегистрБухгалтерии.Хозрасчетный.Обороты(
	               |			&НачДата,
	               |			&КонДата,
	               |			,
	               |			Счет В ИЕРАРХИИ (&СчетПрямЗатрат),
	               |			,
	               |			Организация = &Организация
	               |				И Субконто1 = &Подразделение
	               |				И Субконто2 = &НоменклатурнаяГруппа 
	               |			,
	               |			) КАК ХозрасчетныйОбороты
	               |АВТОУПОРЯДОЧИВАНИЕ"; 
	//"+?(Номенклатура=Неопределено,","," и КорСубконто1 = &Номенклатура,")+"
	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.а2010);
	//СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.а2310);
	Запрос.УстановитьПараметр("НачДата",     Новый Граница(НачалоДня(ДатаНач), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонДата",     Новый Граница(КонецДня(ДатаКон),  ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Организация);
    Запрос.УстановитьПараметр("СчетПрямЗатрат",  СписокСчетов);
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа",НоменклатурнаяГруппа);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.СуммаОборотКт;
	КонецЕсли;
	
КонецФункции

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//	ПоказыватьЗаголовок - признак видимости строк с заголовком отчета
//	ВысотаЗаголовка - параметр, через который возвращается высота заголовка в строках 
//
Процедура СформироватьОтчет(НачалоПериода,КонецПериода,ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок = Ложь, НачалоПодписи, ПоказыватьПодписи) Экспорт

	ДатаНач = НачалоМесяца(НачалоПериода);
	ДатаКон  = КонецМесяца(КонецПериода);
	Если ДатаНач > ДатаКон И ДатаКон <> '00010101000000' Тогда
		Предупреждение("Дата начала периода не может быть больше даты окончания периода");
		Возврат;
	КонецЕсли;
	
	НачалоПериода = НачалоДня(ДатаНач);
	КонецПериода  = КонецДня(ДатаКон);

	ДокументРезультат.Очистить();

	Макет      = ПолучитьМакет("Отчет");

	ЗаголовокОтчета = Макет.ПолучитьОбласть("Заголовок");
	
	ЗаголовокОтчета.Параметры.Период              = "За " + ПредставлениеПериода(НачалоДня(ДатаНач), КонецДня(ДатаКон), "ФП = Истина");
	ЗаголовокОтчета.Параметры.Организация = "" + Организация.НаименованиеПолное;
	//ЗаголовокОтчета.Параметры.ДатаСоставления     = КонецДня(ДатаКон);
	ЗаголовокОтчета.Параметры.НазваниеОтчета      = "Калькуляция себестоимости продукции";
	ДокументРезультат.Вывести(ЗаголовокОтчета);
	
	// Параметр для показа заголовка
	//ВысотаЗаголовка = ДокументРезультат.ВысотаТаблицы;
	
	// Когда нужен только заголовок:
	Если ТолькоЗаголовок Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ВысотаЗаголовка) Тогда
		ДокументРезультат.Область("R1:R" + ВысотаЗаголовка).Видимость = ПоказыватьЗаголовок;
	КонецЕсли;

	СписокСчетов = Новый Массив;
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.А2010);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.А2310);
	

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачДата",     Новый Граница(НачалоДня(ДатаНач), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонДата",     Новый Граница(КонецДня(ДатаКон),  ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Начало",     НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("Конец",     КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("Организация", Организация);
    Запрос.УстановитьПараметр("СчетПрямЗатрат",  СписокСчетов);
    Запрос.УстановитьПараметр("Счет25",  ПланыСчетов.Хозрасчетный.а2510);
    Запрос.УстановитьПараметр("Номенклатура",  Номенклатура);
    Запрос.УстановитьПараметр("Подразделение",  Подразделение);
	
	
	Запрос.Текст = СформироватьТекстЗапроса();
		
   				   
	Результат = Запрос.Выполнить();
	
	
	ОбластьШапка              = Макет.ПолучитьОбласть("Шапка|Основная");
	ОбластьСтрокаЗатрат       = Макет.ПолучитьОбласть("СтрокаЗатрат|Основная");
	ОбластьСчетЗатрат         = Макет.ПолучитьОбласть("СчетЗатрат|Основная");
	ОбластьНоменклатураЗатрат = Макет.ПолучитьОбласть("СтрокаНоменклатурыЗатрат|Основная");
	ОбластьШапка20            = Макет.ПолучитьОбласть("Шапка20|Основная");
	ОбластьШапка25            = Макет.ПолучитьОбласть("Шапка25|Основная");
	ОбластьШапка26            = Макет.ПолучитьОбласть("Шапка26|Основная");
	ОбластьИтого20            = Макет.ПолучитьОбласть("Итого20|Основная");
	ОбластьИтого25            = Макет.ПолучитьОбласть("Итого25|Основная");
	ОбластьИтого26            = Макет.ПолучитьОбласть("Итого26|Основная");
	ОбластьНЗПНач             = Макет.ПолучитьОбласть("НЗПНач|Основная");
	ОбластьНЗПКон             = Макет.ПолучитьОбласть("НЗПКон|Основная");
	ОбластьНЗПИтого           = Макет.ПолучитьОбласть("НЗПИтого|Основная");
	ОбластьОкончаниеТаблицы   = Макет.ПолучитьОбласть("ОкончаниеТаблицы|Основная");
	ОбластьШапкаОкончание              = Макет.ПолучитьОбласть("Шапка|Окончание");
	ОбластьСтрокаЗатратОкончание       = Макет.ПолучитьОбласть("СтрокаЗатрат|Окончание");
	ОбластьСчетЗатратОкончание         = Макет.ПолучитьОбласть("СчетЗатрат|Окончание");
	ОбластьНоменклатураЗатратОкончание = Макет.ПолучитьОбласть("СтрокаНоменклатурыЗатрат|Окончание");
	ОбластьШапка20Окончание            = Макет.ПолучитьОбласть("Шапка20|Окончание");
	ОбластьШапка25Окончание            = Макет.ПолучитьОбласть("Шапка25|Окончание");
	ОбластьШапка26Окончание            = Макет.ПолучитьОбласть("Шапка26|Окончание");
	ОбластьИтого20Окончание            = Макет.ПолучитьОбласть("Итого20|Окончание");
	ОбластьИтого25Окончание            = Макет.ПолучитьОбласть("Итого25|Окончание");
	ОбластьИтого26Окончание            = Макет.ПолучитьОбласть("Итого26|Окончание");
	ОбластьНЗПНачОкончание             = Макет.ПолучитьОбласть("НЗПНач|Окончание");
	ОбластьНЗПКонОкончание             = Макет.ПолучитьОбласть("НЗПКон|Окончание");
	ОбластьНЗПИтогоОкончание           = Макет.ПолучитьОбласть("НЗПИтого|Окончание");
	ОбластьОкончаниеТаблицыОкончание   = Макет.ПолучитьОбласть("ОкончаниеТаблицы|Окончание");
	
	//ОбластьПодвал             = МакетОбщий.ПолучитьОбласть("Подвал");
	
	ВыборкаПодразделение = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Подразделение");
	
	Пока ВыборкаПодразделение.Следующий() Цикл		
		ВыборкаНоменклатурнаяГруппа = ВыборкаПодразделение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатурнаяГруппа");
		
		Пока ВыборкаНоменклатурнаяГруппа.Следующий() Цикл
			ВсегоВыпуск   = ПолучитьСуммуВыпускаПродукции(НачалоПериода,КонецПериода,ВыборкаНоменклатурнаяГруппа.Подразделение,ВыборкаНоменклатурнаяГруппа.НоменклатурнаяГруппа,Неопределено);
			Если ВсегоВыпуск = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ВыборкаНоменклатураВыпуска = ВыборкаНоменклатурнаяГруппа.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Номенклатура");
			
			Пока ВыборкаНоменклатураВыпуска.Следующий() Цикл
				
				Если НЕ ЗначениеЗаполнено(ВыборкаНоменклатураВыпуска.Номенклатура) Тогда
					Продолжить;
				КонецЕсли;
				
				СуммаВыпуска  = ПолучитьСуммуВыпускаПродукции(НачалоПериода,КонецПериода,ВыборкаНоменклатурнаяГруппа.Подразделение,ВыборкаНоменклатурнаяГруппа.НоменклатурнаяГруппа,ВыборкаНоменклатураВыпуска.Номенклатура);
				
				Если СуммаВыпуска = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Коэффициент   = ?(ВсегоВыпуск = 0, 0, СуммаВыпуска   / ВсегоВыпуск);
								
				ОбластьШапка.Параметры.НоменклатураВыпуска         = ВыборкаНоменклатураВыпуска.Номенклатура;
				ОбластьШапка.Параметры.АналитикаВыпуска            = "" + ВыборкаНоменклатураВыпуска.Подразделение.ПолноеНаименование() + " / " + ВыборкаНоменклатураВыпуска.НоменклатурнаяГруппа;
				ОбластьШапка.Параметры.КоличествоВыпуска           = ВыборкаНоменклатураВыпуска.Количество;
				ОбластьШапка.Параметры.СуммаВыпуска                =  ?(ВыборкаНоменклатураВыпуска.Количество = 0, 0, ВыборкаНоменклатураВыпуска.Сумма);
				ОбластьШапка.Параметры.ЦенаВыпуска                 = ?(ВыборкаНоменклатураВыпуска.Количество = 0, ВыборкаНоменклатураВыпуска.Сумма, ВыборкаНоменклатураВыпуска.Сумма / ВыборкаНоменклатураВыпуска.Количество);
				ОбластьШапка.Параметры.ТекстКоличество             = ?(ВыборкаНоменклатураВыпуска.Количество = 0, "", "Количество выпуска:");
				ОбластьШапка.Параметры.ТекстСумма                  = ?(ВыборкаНоменклатураВыпуска.Количество = 0, "", "Фактическая стоимость выпуска:");
				ОбластьШапка.Параметры.СебестоимостьЕдиницы        = "Себестоимость ед.";
                ВывестиОбласть(ДокументРезультат, ОбластьШапка, ОбластьШапкаОкончание, 1, "Группа1", Ложь, "Сумма", ВыборкаНоменклатураВыпуска);

                ВывестиОбласть(ДокументРезультат, ОбластьШапка20, ОбластьШапка20Окончание, 2, "Группа2", Ложь, "Текст", ВыборкаНоменклатураВыпуска);
				ВыборкаПрямыеЗатраты = ВыборкаНоменклатураВыпуска.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ПрямыеЗатраты");
				ИтогоСуммаЗатрат20 = 0;
				ИтогоСуммаЗатрат20ПР = 0;
				ИтогоСуммаЗатрат20ВР = 0;
				Пока ВыборкаПрямыеЗатраты.Следующий() Цикл
					
					ИспользуемыйКоэффициент = Коэффициент;
					
					Если ВыборкаПрямыеЗатраты.СуммаПрямыхЗатрат = 0 и ВыборкаПрямыеЗатраты.СуммаПрямыхЗатратНеРаспределяемая = 0 Тогда
						Продолжить;
					КонецЕсли;
					ВыборкаНоменклатураЗатрат = ВыборкаПрямыеЗатраты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатураПрямыхЗатрат");
					СуммаПрямыхЗатрат   = 0;
					СуммаПрямыхЗатратНеРаспределяемая = 0;
					Если ВыборкаНоменклатураЗатрат.Количество() = 0 Тогда
						СуммаПрямыхЗатрат = ВыборкаПрямыеЗатраты.СуммаПрямыхЗатрат;
						СуммаПрямыхЗатратНеРаспределяемая = ВыборкаПрямыеЗатраты.СуммаПрямыхЗатратНеРаспределяемая;
					Иначе
						Пока ВыборкаНоменклатураЗатрат.Следующий() Цикл
							СуммаПрямыхЗатрат = СуммаПрямыхЗатрат + ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатрат;
							СуммаПрямыхЗатратНеРаспределяемая = СуммаПрямыхЗатратНеРаспределяемая + ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатратНеРаспределяемая;
						КонецЦикла;
					КонецЕсли;
				
					ОбластьСтрокаЗатрат.Параметры.НаименованиеЗатрат = ВыборкаПрямыеЗатраты.ПрямыеЗатраты;
					ОбластьСтрокаЗатрат.Параметры.СуммаЗатрат = СуммаПрямыхЗатрат * ИспользуемыйКоэффициент + СуммаПрямыхЗатратНеРаспределяемая;
                    ВывестиОбласть(ДокументРезультат, ОбластьСтрокаЗатрат, ОбластьСтрокаЗатратОкончание, 2, "Группа2", Ложь, "СуммаЗатрат", ВыборкаПрямыеЗатраты);
					ВыборкаСчетПрямыхЗатрат = ВыборкаПрямыеЗатраты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "КорСчетПрямыхЗатрат");
					
					Пока ВыборкаСчетПрямыхЗатрат.Следующий() Цикл
						
						Если ВыборкаСчетПрямыхЗатрат.СуммаПрямыхЗатрат = 0 и ВыборкаСчетПрямыхЗатрат.СуммаПрямыхЗатратНеРаспределяемая = 0 Тогда
							Продолжить;
						КонецЕсли;
						
					ВыборкаНоменклатураЗатрат = ВыборкаСчетПрямыхЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатураПрямыхЗатрат");
					СуммаПрямыхЗатрат = 0;
					СуммаПрямыхЗатратНеРаспределяемая = 0;
					Пока ВыборкаНоменклатураЗатрат.Следующий() Цикл
						СуммаПрямыхЗатрат = СуммаПрямыхЗатрат + ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатрат;
						СуммаПрямыхЗатратНеРаспределяемая = СуммаПрямыхЗатратНеРаспределяемая + ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатратНеРаспределяемая;
					КонецЦикла;
						СуммаПрямыхЗатрат = ?(СуммаПрямыхЗатрат = 0, ВыборкаСчетПрямыхЗатрат.СуммаПрямыхЗатрат, СуммаПрямыхЗатрат);
						СуммаПрямыхЗатратНеРаспределяемая = ?(СуммаПрямыхЗатратНеРаспределяемая = 0, ВыборкаСчетПрямыхЗатрат.СуммаПрямыхЗатратНеРаспределяемая, СуммаПрямыхЗатратНеРаспределяемая);
						ОбластьСчетЗатрат.Параметры.НаименованиеСчетаЗатрат = РазъяснитьЗатраты(ВыборкаСчетПрямыхЗатрат.КорСчетПрямыхЗатрат);
						ОбластьСчетЗатрат.Параметры.СуммаСчетаЗатрат = СуммаПрямыхЗатрат * ИспользуемыйКоэффициент + СуммаПрямыхЗатратНеРаспределяемая;
                        ВывестиОбласть(ДокументРезультат, ОбластьСчетЗатрат, ОбластьСчетЗатратОкончание, 3, "Группа3", Ложь, "СуммаСчетаЗатрат", ВыборкаСчетПрямыхЗатрат);
						
						ВыборкаНоменклатураЗатрат = ВыборкаСчетПрямыхЗатрат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НоменклатураПрямыхЗатрат");
						Пока ВыборкаНоменклатураЗатрат.Следующий() Цикл
							
							ОбластьНоменклатураЗатрат.Параметры.НаименованиеНоменклатурыЗатрат = ВыборкаНоменклатураЗатрат.НоменклатураПрямыхЗатрат;
							ОбластьНоменклатураЗатрат.Параметры.СуммаНоменклатурыЗатрат        = ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатрат * ИспользуемыйКоэффициент + ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатратНеРаспределяемая;
							ОбластьНоменклатураЗатрат.Параметры.КоличествоНоменклатурыЗатрат   = ВыборкаНоменклатураЗатрат.КоличествоПрямыхЗатрат * ИспользуемыйКоэффициент + ВыборкаНоменклатураЗатрат.КоличествоПрямыхЗатратНеРаспределяемая;
							ОбластьНоменклатураЗатрат.Параметры.ЦенаНоменклатурыЗатрат         = ?(ВыборкаНоменклатураЗатрат.КоличествоПрямыхЗатрат + ВыборкаНоменклатураЗатрат.КоличествоПрямыхЗатратНеРаспределяемая = 0, 0, (ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатрат + ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатратНеРаспределяемая) / (ВыборкаНоменклатураЗатрат.КоличествоПрямыхЗатрат + ВыборкаНоменклатураЗатрат.КоличествоПрямыхЗатратНеРаспределяемая));
							ВывестиОбласть(ДокументРезультат, ОбластьНоменклатураЗатрат, ОбластьНоменклатураЗатратОкончание, 4, "Группа4", Ложь, "СуммаНоменклатурыЗатрат", ВыборкаНоменклатураЗатрат);
							
							ИтогоСуммаЗатрат20 = ИтогоСуммаЗатрат20 + ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатрат * ИспользуемыйКоэффициент + ВыборкаНоменклатураЗатрат.СуммаПрямыхЗатратНеРаспределяемая;
							
						КонецЦикла; // НоменклатураЗатрат
						
					КонецЦикла; // СчетЗатрат
				КонецЦикла;  // ПрямыеЗатраты
				
				ОбластьИтого20.Параметры.ИтогоСуммаЗатрат20 = ИтогоСуммаЗатрат20;
			    ВывестиОбласть(ДокументРезультат, ОбластьИтого20, ОбластьИтого20Окончание, 2, "Группа2", Ложь, "ИтогоСуммаЗатрат20", ВыборкаСчетПрямыхЗатрат);
				
				Всего25 = ВыборкаНоменклатураВыпуска.Сумма25;
				ВсегоСуммаЗатрат   = 0;
				ВсегоСуммаЗатратПР = 0;
				ВсегоСуммаЗатратВР = 0;
				Если НЕ Всего25 = 0 Тогда
			        ВывестиОбласть(ДокументРезультат, ОбластьШапка25, ОбластьШапка25Окончание, 2, "Группа2", Ложь, "Текст", ВыборкаНоменклатураВыпуска);
					Выборка25 = ВыборкаНоменклатураВыпуска.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Затраты25");
					Пока Выборка25.Следующий() Цикл
						ОбластьСтрокаЗатрат.Параметры.НаименованиеЗатрат = Выборка25.Затраты25;
						ОбластьСтрокаЗатрат.Параметры.СуммаЗатрат        = Выборка25.Сумма25 * Коэффициент;
						ВсегоСуммаЗатрат = ВсегоСуммаЗатрат + Выборка25.Сумма25 * Коэффициент;
                        ВывестиОбласть(ДокументРезультат, ОбластьСтрокаЗатрат, ОбластьСтрокаЗатратОкончание, 3, "Группа3", Ложь, "СуммаЗатрат", Выборка25);
					КонецЦикла; 					
					ОбластьИтого25.Параметры.ИтогоСуммаЗатрат25        = ВсегоСуммаЗатрат;
			        ВывестиОбласть(ДокументРезультат, ОбластьИтого25, ОбластьИтого25Окончание, 2, "Группа2", Ложь, "ИтогоСуммаЗатрат25", Выборка25);
		   		КонецЕсли;  // Затраты25
				
				//Всего26 = ВыборкаНоменклатураВыпуска.Сумма26;
				//ВсегоСуммаЗатрат = 0;
				//Если НЕ Всего26 = 0 Тогда
				//	ВывестиОбласть(ДокументРезультат, ОбластьШапка26, ОбластьШапка26Окончание, 2, "Группа2", Ложь, "Текст", ВыборкаНоменклатураВыпуска);
				//	Выборка26 = ВыборкаНоменклатураВыпуска.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Затраты26");
				//	Пока Выборка26.Следующий() Цикл
				//		ОбластьСтрокаЗатрат.Параметры.НаименованиеЗатрат = Выборка26.Затраты26;
				//		ОбластьСтрокаЗатрат.Параметры.СуммаЗатрат        = Выборка26.Сумма26 * Коэффициент;
				//		ВсегоСуммаЗатрат = ВсегоСуммаЗатрат + Выборка26.Сумма26 * Коэффициент;
				//		ВывестиОбласть(ДокументРезультат, ОбластьСтрокаЗатрат, ОбластьСтрокаЗатратОкончание, 3, "Группа3", Ложь, "СуммаЗатрат", Выборка26);
				//	КонецЦикла; 
				//	ОбластьИтого26.Параметры.ИтогоСуммаЗатрат26        = ВсегоСуммаЗатрат;
				//	ВывестиОбласть(ДокументРезультат, ОбластьИтого26, ОбластьИтого26Окончание, 2, "Группа2", Ложь, "ИтогоСуммаЗатрат26", Выборка26);
				//	
				//КонецЕсли;  // Затраты26
				
				НачОстНЗП   = ВыборкаНоменклатураВыпуска.НачОстНЗП   * Коэффициент;
				КонОстНЗП   = ВыборкаНоменклатураВыпуска.КонОстНЗП   * Коэффициент;
				
				Если     НачОстНЗП   <> 0 Или КонОстНЗП   <> 0 Тогда
					   
					ОбластьНЗПНач.Параметры.СуммаНЗПнаНачало = НачОстНЗП;
					ОбластьНЗПКон.Параметры.СуммаНЗПнаКонец  = КонОстНЗП;
					ОбластьНЗПИтого.Параметры.ИтогоНЗП         = НачОстНЗП - КонОстНЗП;
					ОбластьНЗПНач.Параметры.НачалоПериода	  = ДатаНач;
					ОбластьНЗПКон.Параметры.КонецПериода	  =	ДатаКон;
			        ВывестиОбласть(ДокументРезультат, ОбластьНЗПНач, ОбластьНЗПНачОкончание, 2, "Группа2", Ложь, "НачОстНЗП", ВыборкаНоменклатураВыпуска);
			        ВывестиОбласть(ДокументРезультат, ОбластьНЗПКон, ОбластьНЗПКонОкончание, 2, "Группа2", Ложь, "КонОстНЗП", ВыборкаНоменклатураВыпуска);
					//ВывестиОбласть(ДокументРезультат, ОбластьНЗПИтого, ОбластьНЗПИтогоОкончание, 2, "Группа2", Ложь, "ИтогоНЗП", ВыборкаНоменклатураВыпуска);
				КонецЕсли;  // НЗП
				
			    ВывестиОбласть(ДокументРезультат, ОбластьОкончаниеТаблицы, ОбластьОкончаниеТаблицыОкончание, 1, "Группа1", Ложь, "Текст", ВыборкаНоменклатураВыпуска);
			КонецЦикла;  // НоменклатураВыпуска

		КонецЦикла;   // НоменклатурнаяГруппа
	КонецЦикла;    // Подразделение
	
	//ОбластьПодвал.Параметры.ТекстПримечания = "";
	//ДокументРезультат.Вывести(ОбластьПодвал);
	
	//ВысотаПодписи = ДокументРезультат.Области.Подвал.Низ - ДокументРезультат.Области.Подвал.Верх;
	//
	//ДокументРезультат.Области.Подвал.Видимость = ПоказыватьПодписи;
	
	// Первую колонку не печатаем
	ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1,2,ДокументРезультат.ВысотаТаблицы,ДокументРезультат.ШиринаТаблицы);
	
	// Присвоим имя для сохранения параметров печати табличного документа
	ДокументРезультат.ИмяПараметровПечати = "Калькуляция себестоимости";

	
КонецПроцедуры // СформироватьОтчет

Функция РазъяснитьЗатраты(СчетЗатрат)
	СчетУчетаРасчетов = ПланыСчетов.Хозрасчетный.А6000;
	ПустойСчет = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	
	Если СчетЗатрат = ПустойСчет Тогда
		Возврат "";
	КонецЕсли;
	
	Если СчетЗатрат.ПринадлежитЭлементу(СчетУчетаРасчетов) Тогда
		Возврат "Услуги сторонних организаций"
	Иначе
		Возврат СчетЗатрат.Наименование;
	КонецЕсли;
  
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 

НП = Новый НастройкаПериода;

#КонецЕсли
